Repository: sheilagomes/wp-trad
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: A new “doing it wrong” notice when registering REST API endpoints
pt_br: Um novo aviso de "você está fazendo isto errado" ao registrar endpoints na API REST

source: A new “postbox” will be added to the Edit Page screen when editing the policy.
pt_br: Ao editar a política, uma nova área será incluída na tela da página de edição.

source: A notice will now be triggered when developers incorrectly register REST API endpoints (related dev note).
pt_br: Agora um aviso será gerado quando desenvolvedorers registrarem incorretamente endpoints na API REST (nota para desenvolvedores relacionada).

source: A set of plugins to transform your WordPress into a social network
pt_br: Um conjunto de plugins para transformar o seu WordPress em uma rede social

source: A variety of strings such as error messages have been updated for better clarity.
pt_br: Vários textos, como mensagens de erro, foram atualizados e agora são mais claros.

source: A10 - Unvalidated Redirects and Forwards
pt_br: A10 - Redirecionamentos sem validação

source: A8 - Cross Site Request Forgery (CSRF)
pt_br: A8 - Falsificação de solicitação entre sites (CSRF, Cross Site Request Forgery)

source: A9 - Using Components with Known Vulnerabilities
pt_br: A9 - Uso de componentes com vulnerabilidades conhecidas

source: About
pt_br: Sobre

source: About the Team
pt_br: Sobre a equipe

source: Accessibility
pt_br: Acessibilidade

source: Accessibility continues to improve, too.
pt_br: A acessibilidade também continua melhorando.

source: Accessibility: Simplify sidebar tabs aria-labels.
pt_br: Acessibilidade: Simplicação nos aria-labels das abas da barra lateral.

source: Adam White, khaihong, kjellr, Konstantinos Xenos, laurelfulford, lbenicio, Leander Iversen, leemon, macbookandrew, Marius L. J., Matias Ventura, Mel Choyce, mensmaximus, mermel, metalandcoffee, michelleweber, Migrated to @sebastienserre, Milan DiniÄ‡, Muhammad Kashif, Naoko Takano, Nathan Johnson, Ov3rfly, palmiak, Paul Biron, Prashant Baldha, PressTigers, programmin, Rafsun Chowdhury, redcastor, Robin Cornett, Sergey Biryukov, Simon Prosser, skoldin, spyderbytes, Subrata Sarkar, SÃ©bastien SERRE, Tammie Lister, tharsheblows, Thomas Patrick Levy, timbowesohft, Timothy Jacobs, Tobias Zimpel, Tor-Bjorn Fjellner, Towhidul Islam, Usman Khalid, warmlaundry, William Earnhardt, Yui, and YuriV.
pt_br: Adam White, khaihong, kjellr, Konstantinos Xenos, laurelfulford, lbenicio, Leander Iversen, leemon, macbookandrew, Marius L. J., Matias Ventura, Mel Choyce, mensmaximus, mermel, metalandcoffee, michelleweber, Migrated to @sebastienserre, Milan DiniÄ‡, Muhammad Kashif, Naoko Takano, Nathan Johnson, Ov3rfly, palmiak, Paul Biron, Prashant Baldha, PressTigers, programmin, Rafsun Chowdhury, redcastor, Robin Cornett, Sergey Biryukov, Simon Prosser, skoldin, spyderbytes, Subrata Sarkar, SÃ©bastien SERRE, Tammie Lister, tharsheblows, Thomas Patrick Levy, timbowesohft, Timothy Jacobs, Tobias Zimpel, Tor-Bjorn Fjellner, Towhidul Islam, Usman Khalid, warmlaundry, William Earnhardt, Yui e YuriV.

source: Add .button class support.
pt_br: Suporte para a class .button.

source: Add administration tools to facilitate compliance and encourage user privacy in general.
pt_br: Incluir ferramentas de administração que facilitem a conformidade e encorajem a privacidade dos usuários em geral.

source: Add documentation to educate site owners on privacy, the main GDPR compliance requirements, and on how to use the new privacy tools.
pt_br: Gerar documentação que explique sobre privacidade para os proprietários de sites, quais são os principais requisitos de conformidade com o GDPR e como usar as novas ferramentas de privacidade.

source: Add escaping to the language attributes used on html elements.
pt_br: Tratamento dos atributos de idiomas nos elementos html.

source: Add extra functionality to WordPress
pt_br: Adicione funcionalidades ao WordPress

source: Add functionality to assist site owners in creating comprehensive privacy policies for their websites.
pt_br: Adicionar funcionalidades que ajudem os proprietários de sites na criação de políticas de privacidade abrangentes para seus próprios sites.

source: Add up one by one by one
pt_br: Indo de um por um

source: Added LIKE support to meta_key comparisons in WP_Meta_Query (#42409).
pt_br: Adicionado o suporte ao LIKE para comparações entre meta_key na WP_Meta_Query (#42409).

source: Adding a dedicated page for the policy.
pt_br: Adicionando uma página exclusiva para a política.

source: Adding blocks via the plus sign works, and this bug is fixed in the Gutenberg 4.1 plugin.
pt_br: Adicionar blocos através do sinal de adição funciona e este erro já está corrigido na versão 4.1 do Gutenberg.

source: Adding privacy information from plugins.
pt_br: Adicionando informações de privacidade de plugins.

source: Adding support for the “Custom Fields” meta box.
pt_br: Suporte ao meta box de "Campos personalizados".

source: Additional Changes
pt_br: Outras mudanças

source: Additional Reading
pt_br: Leitura adicional

source: Additionally, in April 2019, WordPress’ will increase its minimum supported PHP version to 5.6.
pt_br: Além disso, em abril de 2019, o WordPress aumentará a versão mínima do PHP suportada para 5.6.

source: Additionally, there are some newer bug fixes and features, such as:
pt_br: Além disso, existem alguns ajustes e recursos novos, como por exemplo:

source: Additionally, there have been some bugs fixed that popped up in beta 3:
pt_br: Além disso, foram corrigidos alguns erros que apareceram na versão beta 3:

source: Additionally, there have been some pesky bugs fixed:
pt_br: Além disso, alguns errinhos chatos foram corrigidos:

source: Adds support for Responsive Embeds.
pt_br: Adicionado suporte à mídias incorporadas responsivas.

source: Adds support for Selective Refresh Widgets in the Customiser.
pt_br: Adicionado suporte à atualização seletiva de widgets no Personalizar.

source: Aggregated Statistics
pt_br: Estatísticas agregadas

source: Ajax calls could occasionally cause PHP errors.
pt_br: Chamadas ajax ocasionalmente causavam erros de PHP.

source: All of the older default themes—from Twenty Ten through to Twenty Seventeen—have polished styling in the block editor.
pt_br: Todos os temas padrão mais antigos, do Twenty Ten até o Twenty Seventeen, tiveram seus estilos no editor de blocos melhorados.

source: All of the previous default themes, from Twenty Ten through to Twenty Seventeen, have been updated to support the block editor.
pt_br: Todos os temas padrão anteriores, do Twenty Ten (2010) até o Twenty Seventeen (2017), foram atualizados para dar suporte ao editor de blocos.

source: All of these will be happy to help here.
pt_br: Todos eles ficarão felizes em ajudar.

source: All of this requires your help.
pt_br: Tudo isso requer a sua ajuda.

source: All plugins that collect or store user data will be able to add privacy information there.
pt_br: Lá todos os plugins que coletam ou armazenam dados dos usuários poderão adicionar informações sobre privacidade.

source: All the ones you’ve reported.
pt_br: Todos os que você nos contou.

source: All the way back to Twenty Ten, we’ve updated every default them to look good in the new block editor.
pt_br: Atualizamos todos os temas desde o Twenty Ten, para que eles também fiquem bonitos no novo editor de blocos.

source: All users can see, edit, or delete their personal information at any time (except they cannot change their username).
pt_br: Todos os usuários podem ver, editar ou excluir suas informações pessoais a qualquer momento (só não é possível alterar o seu username).

source: All versions
pt_br: Todas as versões

source: Along with the new block editor, we have a new default theme, called Twenty Nineteen, which takes advantage of the new features the block editor provides.
pt_br: Junto com o novo editor de blocos, temos um novo tema padrão, chamado Twenty Nineteen, que usufrui de todas as vantages dos novos recursos fornecidos pelo editor de blocos.

source: Already have an account?
pt_br: Já tem uma conta?

source: Although the GDPR was introduced two years ago, it becomes enforceable starting May 25, 2018.
pt_br: Apesar do GDPR ter sido criado há dois anos, sua aplicação se tornará obrigatória a partir de 25 de maio de 2018.

source: An Annotations API, allowing plugins to add contextual data as you write.
pt_br: Uma API de Anotações, permitindo que plugins incluam dados contextuais enquanto você escreve.

source: An Amazon Kindle embed block
pt_br: Um bloco para mídia incorporada da Amazon Kindle

source: An RSS block
pt_br: Um bloco RSS

source: An XSS vulnerability was discovered in the Flash fallback files in MediaElement, a library that is included with WordPress.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites (XSS, do inglês Cross-Site Scripting) foi descoberta nos arquivos Flash usados para retrocompatibilidade pelo MediaElement, uma biblioteca que é usada pelos arquivos básicos do WordPress.

source: An in-depth field guide to developer-focused changes is coming soon on the core development blog.
pt_br: Um guia aprofundado com foco nas mudanças para desenvolvedores será publicado em breve no blog de desenvolvimento dos arquivos básicos.

source: An introduction to the WordPress project
pt_br: Uma introdução ao projeto WordPress

source: An update to the parser to better deal with malformed HTML that could cause a loop.
pt_br: Uma atualição para o analisador lide melhor com HTML mal formado, que poderia levar a um loop.

source: And don’t forget to check the stream of WordPress 15th anniversary posts.
pt_br: E não se esqueça de conferir o que as pessoas estão comentando sobre o 15º aniversário do WordPress.

source: And now, early in 2019, we are powering 33.4% of sites.
pt_br: E agora, no começo de 2019, o WordPress está em 33,4% deles.

source: And of course, we’d like to thank all of you using WordPress for using it and trusting in it.
pt_br: E, é claro, também queremos agradecer a você que usa o WordPress e que confia nele.

source: And then there are a number of secondary benefits:
pt_br: Há ainda alguns benefícios secundários:

source: Appendix
pt_br: Apêndice

source: Application Framework
pt_br: Estrutura para aplicações

source: Articles on this site may include embedded content (e.g. videos, images, articles, etc.).
pt_br: Artigos neste site podem incluir conteúdo incorporado como, por exemplo, vídeos, imagens, artigos, etc.

source: As a final reminder: contact your hosting company, a professional web developer, or your theme and/or plugin authors for any additional questions.
pt_br: Um lembrete final: entre em contato com a sua empresa de hospedagem, um desenvolvedor web profissional ou com os autores do seu tema ou plugin para mais informações.

source: As part of the core team's ongoing commitment to security hardening, the following fixes have been implemented in 4.9.1:
pt_br: Como parte do compromisso da equipe dos arquivos básicos de aumentar a segurança, os seguintes ajustes foram implementados na versão 4.9.1:

source: As part of the core team's ongoing commitment to security hardening, the following fixes have been implemented in 4.9.5:
pt_br: Como parte do compromisso da equipe dos arquivos básicos de aumentar a segurança, os seguintes ajustes foram implementados na versão 4.9.5:

source: As the PHP version is set at the server level by your hosting company, updating involves either interacting with your host’s settings or asking them to do it.
pt_br: Como a versão do PHP é configurada a nível de servidor pela sua empresa de hospedagem, atualizar envolve alterar as configurações do seu servidor ou pedir que a empresa faça isso por você.

source: As various businesses use WordPress, the variety of WordPress sites grows.
pt_br: Como negócios de vários ramos e tamanhos diferentes usam o WordPress, a variedade de sites WordPress também cresce.

source: As with most things technical, we just need to cover some background before we can get to the part where you update your PHP version.
pt_br: Como na maioria dos assuntos técnicos, é preciso atentar para pontos importantes antes que possamos chegar na parte onde você atualiza a sua versão do PHP.

source: Ask for it
pt_br: Pergunte sobre isso

source: Automatic Background Updates for Security Releases
pt_br: Instalação automática em segundo plano de atualizações de segurança

source: Because PHP is so popular, it is a target for hackers – but the latest version will have the latest security features.
pt_br: Por ser tão popular, o PHP é um alvo para hackers, porém a versão mais recente terá os recursos de segurança mais atualizados.

source: Because the Flash files are no longer needed for most use cases, they have been removed from WordPress.
pt_br: Como os arquivos Flash já não são mais necessários na maioria dos casos, eles foram removidos do WordPress.

source: Becoming a Better Speaker
pt_br: Como ser um(a) palestrante melhor

source: Before you update your PHP version
pt_br: Antes que você atualize a sua versão do PHP

source: Before you update your PHP version # Before you update your PHP version
pt_br: Antes que você atualize a sua versão do PHP # Antes que você atualize a sua versão do PHP

source: Before, you’d have to FTP in to your files or get in touch with your host.
pt_br: Antes, você teria que acessar os seus arquivos através do FTP ou entrar em contato com o seu serviço de hospedagem.

source: Beta &amp; RC releases
pt_br: Versões beta e RC

source: Better handling for links without an href attribute, which were showing as undefined.
pt_br: Melhor tratamento de links sem um attributo href, que apareciam como undefined.

source: Better handling for different text encodings (e.g. emoji) within a block in block validation.
pt_br: Melhor tratamento de encodings diferentes de texto, como emojis por exemplo, na validação do bloco.

source: Better support for plugins that have more advanced meta box usage.
pt_br: Melhor suporte a plugins que fazem uso mais avançado das meta boxes.

source: Bill of Rights
pt_br: Declaração de Direitos

source: Block Editor
pt_br: Editor de blocos

source: Block Management Modal
pt_br: Gerenciamento de blocos

source: Blog Archives
pt_br: Arquivo

source: Built-in Comments
pt_br: Comentários nativos

source: Bulk editing posts will no longer unintentionally change a post’s post format (#44914)
pt_br: Posts editados em massa não têm mais seu formato alterado sem que haja intenção (#44914)

source: But close.
pt_br: Mas quase.

source: By default WordPress does not collect any analytics data.
pt_br: Por padrão, o WordPress não coleta nenhum dado para análise.

source: CSS: Fix visual issues with Button block text wrap.
pt_br: CSS: Ajustes em problemas visuais na disposição do texto do bloco de Botão.

source: CSS: Improve block preview styling.
pt_br: CSS: Melhoria na visualização de estilos de bloco.

source: Categories
pt_br: Categorias

source: Celebrate the WordPress 15th Anniversary on May 27
pt_br: Celebre o 15º aniversário do WordPress no dia 27 de maio

source: Change @package names to WordPress.
pt_br: Alteração do nome nos @package para WordPress.

source: Check out the developer note to get started.
pt_br: Leia as notas de desenvolvimento para saber mais.

source: Check the WordPress 15th Anniversary website to see if there’s a party already planned for your town.
pt_br: Acesse o site do 15º aniversário do WordPress para ver se já existe uma festa sendo planejada na sua cidade.

source: Check your email for a confirmation link.
pt_br: Confira seu e-mail por um endereço de confirmação.

source: Co-founder of WordPress, an example of what WordPress can do
pt_br: Cofundador do WordPress, um exemplo do que o WordPress pode fazer

source: Code is Poetry.
pt_br: Código é Poesia.

source: Comments are closed.
pt_br: Os comentários estão desativados.

source: Community
pt_br: Comunidade

source: Community Events Dashboard: Always show the nearest WordCamp if one is coming up, even if there are multiple Meetups happening first.
pt_br: Eventos da comunidade no Painel: Sempre mostra o WordCamp mais próximo se há algum previsto, mesmo que existam vários meetups planejados antes dele.

source: Complete your WordPress.org Profile information.
pt_br: Complete as informações do seu perfil no WordPress.org.

source: Consider setting up a test site just to play with the new version.
pt_br: Considere criar um site de teste só para brincar com a nova versão.

source: Consider setting up a test site to play with the new version, and if you are using an existing test site be sure to update the Gutenberg plugin to v4.1.
pt_br: Considere criar um site de testes para testar a nova versão e, se você já está usando um site de testes, tenha certeza de atualizar o plugin Gutenberg para a versão 4.1.

source: Consider setting up a test site to play with the new version.
pt_br: Considere criar um site de testes para testar a nova versão.

source: Continue reading <span class="meta-nav">&rarr;</span>
pt_br: Continuar lendo <span class="meta-nav">&rarr;</span>

source: Continue reading<span class="screen-reader-text"> "%s"</span> &rarr;
pt_br: Continuar lendo<span class="screen-reader-text"> "%s"</span> &rarr;

source: Contribute
pt_br: Contribua

source: Core WordPress APIs
pt_br: APIs dos arquivos básicos do WordPress

source: Cosmetic and minor changes in RC2
pt_br: Mudanças cosméticas e menores no RC2

source: Create Account
pt_br: Criar conta

source: Create a WordPress.org account to start contributing to WordPress, get help in the support forums, or rate and review themes and plugins.
pt_br: Crie uma conta no WordPress.org para começar a contribuir para o WordPress, obter ajuda nos fóruns ou classificar e avaliar temas e plugins.

source: Create an account
pt_br: Criar uma conta

source: Create guidelines for plugins to become GDPR ready.
pt_br: Criar diretrizes para que os plugins se tornem compatíveis com o GDPR.

source: Creating Great Slides
pt_br: Como criar ótimos slides

source: Creating Your WordPress Talk
pt_br: Como criar sua apresentação sobre o WordPress

source: Cron API
pt_br: API Cron

source: Cropping on touch screen devices is now supported.
pt_br: Agora é possível recortar imagens em dispositivos com telas sensíveis ao toque.

source: Currently, the GDPR Compliance Team understands that helping WordPress-based sites become compliant is a large and ongoing task.
pt_br: A Equipe de conformidade com o GPDR entende que ajudar os sites criados com o WordPress a se tornarem compatíveis com o regulamento é uma tarefa enorme e que ainda está em andamento.

source: Custom Content Types
pt_br: Tipos personalizados de conteúdo

source: Custom nonce functionality in the REST API JavaScript client has been made consistent throughout the code base.
pt_br: A funcionalidade de código de verificação (nonce) personalizado na API REST de JavaScript agora está consistente por todo o código.

source: Customiser options have been added for changing the theme colours and feature image filters.
pt_br: Foram adicionadas opções no Personalizar para alterar as cores do tema e filtros nas imagens destacadas.

source: Customizable<br />Designs
pt_br: Designs<br />personalizáveis

source: Database API
pt_br: API de banco de dados

source: Date
pt_br: Data

source: Dear Hosting Provider,
pt_br: Empresa de hospedagem,

source: Decisions, not Options
pt_br: Decisões, não opções

source: Default Themes
pt_br: Temas padrão

source: Democratize Publishing
pt_br: Liberdade para publicar

source: Description #Description
pt_br: Descrição #Description

source: Design for the Majority
pt_br: Design para a maioria

source: Developer Features
pt_br: Recursos para desenvolvedores

source: Developer Happiness
pt_br: Felicidade para os desenvolvedores

source: Developer Notes
pt_br: Notas para desenvolvedores

source: Developers
pt_br: Desenvolvedores

source: Developers can now add translatable strings directly to your JavaScript code, using the new JavaScript language packs.
pt_br: Desenvolvedores agora podem adicionar strings traduzíveis diretamente em seus códigos JavaScript, usando os novos pacotes de idioma JavaScript.

source: Did not receive array from %1$s eraser (index %2$d).
pt_br: Array não recebido do autor %1$s da remoção (índice %2$d).

source: Discover more sites built with WordPress
pt_br: Descobra mais sites construídos com WordPress

source: Do you enjoy bugs?
pt_br: Você gosta de erros?

source: Do you feel like you don’t have anything worth sharing?
pt_br: Você se sente como se não tivesse nada que vale a pena compartilhar?

source: Do you have no idea what to talk about?
pt_br: Não tem ideia sobre o que falar?

source: Do you really want to <a href="%s">log out</a>?
pt_br: Quer mesmo <a href="%s">sair</a>?

source: Do you speak a language other than English?
pt_br: Ajude a tradução em Português!

source: Do you speak a language other than English? Help us translate WordPress into more than 100 languages!
pt_br: Você lê e escreve bem em inglês? Ajude-nos a traduzir o WordPress para o português!

source: Do you speak a language other than English? Help us translate WordPress into more than 100 languages! The beta 2 release also marks the soft string freeze point of the 5.1 release schedule.
pt_br: Ajude-nos a traduzir o WordPress para o português! O lançamento da versão beta 2 também significa que novas strings para tradução da versão 5.1 serão evitadas.

source: Domains
pt_br: Domínios

source: Don't treat localhost as same host by default.
pt_br: Localhost não é mais considerado como servidor por padrão.

source: Donate
pt_br: Doe

source: Donate to the WordPress Foundation
pt_br: Doe para a Fundação WordPress

source: Don’t miss this chance to participate in a global celebration of WordPress!
pt_br: Não perca esta chance de participar de uma celebração global do WordPress!

source: Don’t we already have a privacy policy?
pt_br: Nós já não temos uma política de privacidade?

source: Download
pt_br: Baixar

source: Download .tar.gz &mdash; %s MB
pt_br: Baixar arquivo .tar.gz &mdash; %s MB

source: Download WordPress %s
pt_br: Baixar o WordPress %s

source: Easy Installation and Upgrades
pt_br: Instalação e atualização fáceis

source: Easy Theme System
pt_br: Fácil sistema de temas

source: Easy and<br />Accessible
pt_br: Fácil e<br />acessível

source: Edit
pt_br: Editar

source: Edit %s
pt_br: Editar %s

source: Edit<span class="screen-reader-text"> "%s"</span>
pt_br: Editar<span class="screen-reader-text"> "%s"</span>

source: Editor Performance
pt_br: Desempenho do editor

source: Editor document panels can now be programmatically removed.
pt_br: Os painéis de documento do editor agora podem ser removidos programaticamente.

source: Eleven other bugs were fixed in WordPress 4.9.1.
pt_br: Outros onze erros foram resolvidos no WordPress 4.9.1.

source: Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.
pt_br: Conteúdos incorporados de outros sites se comportam exatamente da mesma forma como se o visitante estivesse visitando o outro site.

source: Ensure the attributes of enclosures are correctly escaped in RSS and Atom feeds.
pt_br: Verificação do escape dos fechamentos dos atributos em feeds RSS e Atom.

source: Eraser array at index %d does not include a callback.
pt_br: Array do autor da remoção no índice %d não inclui um callback.

source: Eraser array at index %d does not include a friendly name.
pt_br: Autor da remoção no índice %d não inclui um nome amigável.

source: Eraser callback at index %d is not a valid callback.
pt_br: Callback do autor da remoção no índice %d não é válido.

source: Eraser index cannot be less than one.
pt_br: Índice do autor da remoção não pode ser menor que um.
